import com.sun.org.apache.xpath.internal.SourceTree;

/*
 Создать класс, который содержит int и char (не проинициализированные) и распечатать их

значения.
 */
public class IntAndChar {

    static int digit;                               //объявляем перменные
    static char aChar;

    public static void main(String[] args) {

        System.out.println("We have " + digit + " & " + aChar);

    }

}
